import React from "react";
import { MapContainer, TileLayer, Popup, GeoJSON } from "react-leaflet";
import nat1 from "../data/IskarStruma1.json";
import nat2 from "../data/DunavChernoMore2.json";
import nat3 from "../data/YantraMaritsa3.json";
import nat4 from "../data/Predbalkan4.json";
import nat5 from "../data/Ludogorie5.json";
import nat6 from "../data/Podbalkanski6.json";
import nat7 from "../data/Chernomorski7.json";
import nat8 from "../data/ViaDiagonalis8.json";
import nat10 from "../data/IronCurtainTrail10.json";

export default function Map() {
  return (
    <>
      <div className="map_container">
      <MapContainer center={[42.705, 25.09]} zoom={7.4} scrollWheelZoom={true}>
        <TileLayer
          attribution='&copy; <a href="https://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors'
          url="https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png"
        />
        <GeoJSON data={nat1.features} style={{ color: "#ffeb3b" }}>
          <Popup>Национален маршрут 1 - Искър-Струма</Popup>
        </GeoJSON>
        <GeoJSON data={nat2.features} style={{ color: "#3b83d1" }}>
          <Popup>Национален маршрут 2 - Дунав-Черно море</Popup>
        </GeoJSON>
        <GeoJSON data={nat3.features} style={{ color: "#827717" }}>
          <Popup>Национален маршрут 3 - Янтра-Марица-Арда</Popup>
        </GeoJSON>
        <GeoJSON data={nat4.features} style={{ color: "green" }}>
          <Popup>Национален маршрут 4 - Предбалкан</Popup>
        </GeoJSON>
        <GeoJSON data={nat5.features} style={{ color: "orange" }}>
          <Popup>Национален маршрут 5 - Лудогорие</Popup>
        </GeoJSON>
        <GeoJSON data={nat6.features} style={{ color: "#7cb342" }}>
          <Popup>Национален маршрут 6 - Подбалкански</Popup>
        </GeoJSON>
        <GeoJSON data={nat7.features} style={{ color: "#2042b3" }}>
          <Popup>Национален маршрут 7 - Черноморски</Popup>
        </GeoJSON>
        <GeoJSON data={nat8.features} style={{ color: "#8e24aa" }}>
          <Popup>Национален маршрут 8 - Виа Диагоналис</Popup>
        </GeoJSON>
        <GeoJSON data={nat10.features} style={{ color: "#d32f2f" }}>
          <Popup>Национален маршрут 9 - Пътя на Желязната завеса</Popup>
        </GeoJSON>
      </MapContainer>
    </div>
      <div className="block_offset">
        <h2 className="heading">Концепция за национална мрежа от велосипедни маршрути</h2>
        <div className="text text_column">
          Създаването на мрежа от национални велосипедни маршрути в България има за цел да определи основни направления за развитие на велосипедни маршрути, които да свързват страната в посока север-юг и запад-изток. Изборът на направление се характеризира със следните особености:
          <ul>
            <li>създаване на възможност за преминаване с велосипед през територията на страната за пътуващи от и към съседни на България страни;</li>
            <li>свързване на националните маршрути с маршрутите на съседните страни;</li>
            <li>свързване на участъците на ЕвроВело маршрут 13, където той преминава в съседни страни, така че да се получи непрекъснат национален маршрут;</li>
            <li>създаване на възможност за бъдещо свързване на участъци от националните маршрути чрез регионални и местни маршрути;</li>
            <li>свързване на големите населени места, в които се генерират основните туристически потоци, с туристическите дестинации, където се концентрират забележителностите и предлагането на туристически услуги;</li>
            <li>съобразяване с релефа и други географски условия на страната, така че да се избегнат прекалено дълги и стръмни изкачвания, като същевременно маршрутите придобият тематичност основана на концепцията за туристическо райониране на България;</li>
            <li>съобразяване с железопътната мрежа на страната, което да подобри достъпността на маршрутите и да осигури алтернативно придвижване в случай на необходимост.</li>
          </ul>
          Първоначалното определяне на велосипедните маршрути от перспективата на международното и националното равнище позволява да се избегне разпокъсано възникване на местни и регионални маршрути, което впоследствие трудно би могло да се обособи като пълноценна йерархична мрежа. Същевременно, такова определяне налага огромна по обем работа, ако крайната му цел трябва да бъде детайлно определяне на всички трасета. Затова като основен резултат на настоящата концепция трябва да се разглежда определянето на основните направления, които да бъдат следвани за определянето на национални велосипедни маршрути. Определянето на конкретните трасета следва да отчита редица съображения на местно равнище при планирането, изграждането на необходимата инфраструктура и реализирането на маршрутите като краен продукт.
          <br />
          <br />
          Нуждите и ползите от използването на велосипед при пътуванията започват да се налагат като обществено значими едва към края на ХХ и началото на XIX в. Към този период пътната мрежа вече е изградена въз основа на нуждите на автомобилния транспорт. Това създава съществени трудности при изграждане на велосипедна инфраструктура, която да е отделена, така че да ползва собствена мрежа от пътища и алеи. Затова в световната практика се е наложил подход на интегриране на велосипедната инфраструктура в рамките на съществуващата пътна мрежа чрез различни методи, вкл. нейното разширяване или за сметка на ползване на част от пространството определено за автомобилно движение. 
          <br />
          <br />
          Интегрирането на велосипедна инфраструктура, която да обезпечи мрежата от национални и велосипедни маршрути в България също следва да се съобрази с вече изградената пътна мрежа в страната. Това значително усложнява задачата по определяне на велосипедните маршрути. Затова, освен определяне на основните направления, настоящата концепция предлага като пример конкретни трасета на маршрутите, което цели да илюстрира възможностите за реализация на национална велосипедна мрежа. В процеса на реализация на всеки маршрут предложените трасета следва да бъдат подложени на детайлна оценка спрямо местните условия, преди да бъдат предприети конкретни действия.
          <br />
          <br />
        </div>
      </div>
    </>
  );
}
